[
  {
    "movieId": "2026-movie-a",
    "panelistId": "zach",
    "score": 7.0,
    "reviewText": "Good effects, but I don't really like the blue people story stuff too much.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-b",
    "panelistId": "zach",
    "score": 9.5,
    "reviewText": "Amazing time. Top 5 of all time. I loved the honey scene.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-c",
    "panelistId": "noah",
    "score": 6,
    "reviewText": "Del Toro presents a compelling vision in Frankenstien 2025, a movie with good and bad qualities. The standout is Oscar Issacs compelling performance as Victor, who manages to be the compelling mad scientist that the story deserves. Practical effects are also excellent, although the decision to include strange-looking CGI deer and wolfs in the middle portion cheapened the work of the effects team.\n\nWhere Frankenstien really goes wrong is in its overbearing sentimentality. This is most true in the overbearing score, and some parts of the script. Frankenstein is filled with saccarine moments, building throughout the movie, rather than true pathos. The monster, who we see viciously murdering people at the beginning of the movie (the end chronologically), feel like a character who would never do such a thing once we see his path to get to that moment. While the depiction of the monster is more in line with Mary Shelley’s vision than some modern references, Del Toro makes him altruistic to the point of one-dimensionality. A monster that is unquestionably good is no more interesting than a monster that is unquestionably evil. Like any being, the monster should have some rougher edges to his intentions. In Frankenstien 2025, he is an almost completely pure entity, which diminishes the character.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "noah",
    "score": 8,
    "reviewText": "I liked the character-driven approach of one battle after another, and the acting was all great. The long shots during the ending car-chase scene were a great western touch. Leonardo de Caprio’s character falling off a tree will always be pretty funny",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "noah",
    "score": 7,
    "reviewText": "Kpop demon hunters is a childrens movie which is enjoyable for adults. While the story structure is basic (it could be used for a great film 101 examplar) it is executed very well. The movie makes due with a much lower budget than Disney or Pixar, and while this is visible in somewhat static backgrounds and less realisitic physics, the film uses this limitation in many instances as a strength. A good example is that character assets often move in complete synchronization to each other, a slightly uncanny effect which only slightly exaggerates the synchronization of actual Kpop bands. The standout here is the music, with several songs (e.g., Soda Pop, Golden, Your Idol) which are earwormy singles outside of the confines of the movie plot).",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "noah",
    "score": "5",
    "reviewText": "The success of horror often hinges on the central metaphor. Movies that are scary because they bring up fears that we experience in real-life have more staying power than movies which rely on jump scares and scary imagery. While Weapons attempts to have a central metaphor, it is both too on the nose (an AR 15 hovering over a house), and too unconnected to the plot (which is about witches kidnapping children) to be thematically comprehensible. Also, the police in the movie are complete idiots. The first thing the detectives should do is look at what direction the children ran in, to see if they went to the same place. But it took a community member to come up with this incredibly simple way of solving the mystery.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "zach",
    "score": "5.5",
    "reviewText": "I liked the bit when the kids tore the woman to shreds. However, as well-made as it was, I think they spoiled \"the twist\" a bit too early on, and so the rest of the movie felt a bit underwhelming.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-g",
    "panelistId": "sam",
    "score": "8.5",
    "reviewText": "I really loved Sinners. It’s intense, confident, and way more emotionally grounded than I expected. What stuck with me most is how clearly the film understands that “sin” isn’t neutral—race shapes who gets sympathy, who gets forgiveness, and who’s condemned from the jump.\nThe movie does a great job showing how Black characters are constantly watched, judged, and read as guilty, even in moments of vulnerability. There’s this ongoing tension between being seen and being surveilled, between confession as honesty and confession as something dangerous. None of it feels preachy—the racial themes are baked into the story, the performances, and even how the camera moves.",
    "reviewDate": "2026-01-25"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "sam",
    "score": "9",
    "reviewText": "Weapons is one of those movies that creeps up on you and doesn’t let go. It starts off feeling familiar, almost deceptively so, and then slowly turns the screws until everything feels off in the best way. The tension builds patiently, without relying on cheap shocks, and when it does hit, it lands hard.\nWhat really worked for me was how unsettling the atmosphere is. There’s this constant sense that something is wrong, even in the quieter moments, and the movie trusts the audience enough to sit with that discomfort. The performances feel grounded, which makes the horror elements hit even harder—you believe these people, so you care when things spiral.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-a",
    "panelistId": "sam",
    "score": "7.5",
    "reviewText": "Avatar 3 is really cool to look at—like, insanely cool. The visuals and world-building are still doing most of the heavy lifting, and some of the new stuff on Pandora is genuinely awesome.\nBut story-wise, it didn’t totally pull me in. A lot is happening, and not all of it hits emotionally. I wasn’t bored, just not fully locked in.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "sam",
    "score": "6",
    "reviewText": "K-Pop Demon Hunters is colorful, fast, and clearly made with kids in mind. The music is catchy, the animation pops, and it moves at a fun clip without getting too scary. I can totally see younger audiences loving it.\nThat said, it wasn’t really my thing. The story and humor felt pretty lightweight, and I never fully clicked with it. Still, it’s fun for what it is—just not a movie that was meant for me.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "jacob",
    "score": "8",
    "reviewText": "Set in a small town, Weapons felt full of personality and character. And that, the people, was the films real focus. Its supernatural main story line was well done but came short of the believability which makes a horror film what it is—scary. Instead the ‘scary story’ served mostly to frame the lives of the everyday folks impacted by the traumatic goings-on in their community. We see these events through the lens of a young female teacher, a cop, a father, an orphan, an old lady, and a drug addict. Their lives and their relationships with one other is what most of the movie is concerned with, building a suspense for the eventual standoff with the big bad, which suspense —unlike most films of the genre—feels anything but gratuitous.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-g",
    "panelistId": "stephan",
    "score": "10",
    "reviewText": "The amount of genre blending that this film does should be illegal. Michael B. Jordan gives an incredible performance as a believable set of twins. That oner will forever be one of my favorite film sequences of all time",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "stephan",
    "score": "9.5",
    "reviewText": "I didn’t initially believe the hype this movie had. It seemed too good to be true, but I was wrong and my expectations were understated. I genuinely believe this film is the Best Picture winner for the 2025 year, and it deserves all of its praise ",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-h",
    "panelistId": "stephan",
    "score": "8",
    "reviewText": "Can’t say much about this one other than the fact that Jesse Plemmons deserves an Oscar nod for this role, and Emma Stone kills it as always. Go watch",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-i",
    "panelistId": "stephan",
    "score": "7",
    "reviewText": "Vroom vroom car go fast",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-c",
    "panelistId": "stephan",
    "score": "6",
    "reviewText": "I was disappointed by this one. Guiellermo del Toro has made some beautiful films, and this one is no exception, but where it thrives in visuals, it falls apart in Jacob Elordi’s lackluster performance and utterly snail-like pacing",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-j",
    "panelistId": "stephan",
    "score": "8",
    "reviewText": "This one made me cry. There’s something beautiful about experiencing a man just live his life, experiencing love, loss, renewal, and death, all in a 2 hour runtime",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-b",
    "panelistId": "stephan",
    "score": "8.5",
    "reviewText": "I genuinely need to know the marketing budget for this film. It had to have been off the walls..\nAnyway, Timothee kills it in this role and gives it his all without it feeling like his desperate attempt at achieving an Oscar win. The pacing is relentless, evoking the feelings of “Good Time,” and “Uncut Gems,” yet unlike those films, it feels breathable at times, which was refreshing",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-k",
    "panelistId": "zach",
    "score": "4",
    "reviewText": "I guess it was cool to see police procedures of a true crime (especially about one as emotional as this crime) through body cam footage, but even as far as the true crime genre goes - it wasn't all that exciting. And as far as body cam footage goes, COPS is much more entertaining. I genuinely feel like the overwhelmingly positive reviews are a result of people going \"Wow! So innovative!\", and it honestly feels a little performative. Wouldn't recommend tbh. Just read about the case if you want lol.",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "beau",
    "score": "6.5",
    "reviewText": "I entered the theatre with high expectations and left slightly disappointed, though with a bizarre appreciation for Sean Penn. On the whole, <i>One Battle After Another</i> feels like an overbuilt attempt at a <i>Pulp Fiction</i> –esque, stylized, period-set, action-dramedy, but it lacks any real originality. It isn’t as narratively polished as PTA’s classics, nor are the characters as compelling. Impersonal performances from DiCaprio, Taylor, and Infiniti somehow manage to feel both bland and overacted, while Sean Penn erupts with a performance whose raw, intoxicating conviction seems imported from a far more interesting film. Moments feel like scenes, places look like sets, and relentless, unabashed attempts at social commentary quickly begin to grate. The narrative, while technically coherent, is only enjoyable if one accepts the intrusion of the least plausible choice at every turn. A few genuinely edgy comedic beats and Penn’s spiritually indomitable Colonel Lockjaw offer a much needed respite.",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-i",
    "panelistId": "beau",
    "score": "6",
    "reviewText": "Race cars are very cool, as is Brad Pitt. <i>F1</i> is predicated on those two facts, and little thought is put to anything else. There is minimal emotional depth to this film, but it is nevertheless enjoyable by virtue of its dual-threat approach.",
    "reviewDate": "2026"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "beau",
    "score": "7.5",
    "reviewText": "Some movies just seem to squeeze more than their fair share of fun out of a runtime. A dense, energetic masterclass in breathing new life into time-tested themes, <i>K-Pop Demon Hunters</i> earned its brief, fiery run as a cultural phenomenon through timely cultural positioning, an excellent original score, and magnetic animation. The good-versus-evil plot is dead simple, yet inventively framed and thematically boosted by a healthy splash of yin and yang. Contrasting lighthearted K-pop performances with PG-rated demon-slaying action is borderline inspired beneath the spellbinding bump of instant classics like Huntrix’s “Golden” and Saja Boy’s “Soda Pop.” By leaning completely into the creative freedoms provided by animation and sticking firmly to the tenets of good storytelling, <i>K-Pop Demon Hunters</i> turns what could have been a middling children’s screenplay into an engaging, if low-impact, musical whirlwind. ",
    "reviewDate": "2026"
  },
  {
    "movieId": "",
    "panelistId": "",
    "score": "",
    "reviewText": "",
    "reviewDate": ""
  }
]
