[
  {
    "movieId": "2026-movie-a",
    "panelistId": "zach",
    "score": 7.0,
    "reviewText": "Good effects, but I don't really like the blue people story stuff too much.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-b",
    "panelistId": "zach",
    "score": 9.5,
    "reviewText": "Amazing time. Top 5 of all time. I loved the honey scene.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-c",
    "panelistId": "noah",
    "score": 6,
    "reviewText": "I liked Frankenstein because the monster was blue, and I didn’t like Frankenstein because they play really sappy music at the end",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "noah",
    "score": 8,
    "reviewText": "I liked the character-driven approach of one battle after another, and the acting was all great. The long shots during the ending car-chase scene were a great western touch. Leonardo de Caprio’s character falling off a tree will always be pretty funny",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "noah",
    "score": 7,
    "reviewText": "I like the songs in Kpop demon hunters and the animation was pretty good for having a low budget",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "noah",
    "score": "5",
    "reviewText": "My review of Weapons is I didn’t finish it because I thought is was a bit boring",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "zach",
    "score": "5.5",
    "reviewText": "I liked the bit when the kids tore the woman to shreds. However, as well-made as it was, I think they spoiled \"the twist\" a bit too early on, and so the rest of the movie felt a bit underwhelming.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-g",
    "panelistId": "sam",
    "score": "8.5",
    "reviewText": "I really loved Sinners. It’s intense, confident, and way more emotionally grounded than I expected. What stuck with me most is how clearly the film understands that “sin” isn’t neutral—race shapes who gets sympathy, who gets forgiveness, and who’s condemned from the jump.\nThe movie does a great job showing how Black characters are constantly watched, judged, and read as guilty, even in moments of vulnerability. There’s this ongoing tension between being seen and being surveilled, between confession as honesty and confession as something dangerous. None of it feels preachy—the racial themes are baked into the story, the performances, and even how the camera moves.",
    "reviewDate": "2026-01-25"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "sam",
    "score": "9",
    "reviewText": "Weapons is one of those movies that creeps up on you and doesn’t let go. It starts off feeling familiar, almost deceptively so, and then slowly turns the screws until everything feels off in the best way. The tension builds patiently, without relying on cheap shocks, and when it does hit, it lands hard.\nWhat really worked for me was how unsettling the atmosphere is. There’s this constant sense that something is wrong, even in the quieter moments, and the movie trusts the audience enough to sit with that discomfort. The performances feel grounded, which makes the horror elements hit even harder—you believe these people, so you care when things spiral.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-a",
    "panelistId": "sam",
    "score": "7.5",
    "reviewText": "Avatar 3 is really cool to look at—like, insanely cool. The visuals and world-building are still doing most of the heavy lifting, and some of the new stuff on Pandora is genuinely awesome.\nBut story-wise, it didn’t totally pull me in. A lot is happening, and not all of it hits emotionally. I wasn’t bored, just not fully locked in.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "sam",
    "score": "6",
    "reviewText": "K-Pop Demon Hunters is colorful, fast, and clearly made with kids in mind. The music is catchy, the animation pops, and it moves at a fun clip without getting too scary. I can totally see younger audiences loving it.\nThat said, it wasn’t really my thing. The story and humor felt pretty lightweight, and I never fully clicked with it. Still, it’s fun for what it is—just not a movie that was meant for me.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "jacob",
    "score": "8",
    "reviewText": "Set in a small town, Weapons felt full of personality and character. And that, the people, was the films real focus. Its supernatural main story line was well done but came short of the believability which makes a horror film what it is—scary. Instead the ‘scary story’ served mostly to frame the lives of the everyday folks impacted by the traumatic goings-on in their community. We see these events through the lens of a young female teacher, a cop, a father, an orphan, an old lady, and a drug addict. Their lives and their relationships with one other is what most of the movie is concerned with, building a suspense for the eventual standoff with the big bad, which suspense —unlike most films of the genre—feels anything but gratuitous.",
    "reviewDate": "2026-01-26"
  }
]
