[
  {
    "movieId": "2026-movie-a",
    "panelistId": "zach",
    "score": 7,
    "reviewText": "The story is just not that exciting tbh. The only reason I gave it the score I did is because these movies are indeed great cinematic experiences. Watching it on the largest iMax theatre in the country in 3D made it even cooler. But yeah, the story and writing just aren't that great. I didn't think aliens would say \"bruh\" as often as they did in this film. Whatever though, just take my money. I'll watch your 4th and 5th installments, James Cameron.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-b",
    "panelistId": "zach",
    "score": 9.5,
    "reviewText": "I went into this thinking it might just be an overly-dramatic sports biopic (two genres I'm not really into), but I was very wrong. It's more about the journey Marty goes on, which is insane. Amazing time. Truly one of the most fun movie-watching experiencing I've ever had. I also love movies that showcase 20th century NYC. It has some wild scenes in it (I loved the honey scene). I think it's probably in my Top 5 of all time tbh. Seriously, go watch it.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-c",
    "panelistId": "noah",
    "score": 6,
    "reviewText": "Del Toro presents a compelling vision in Frankenstien 2025, a movie with good and bad qualities. The standout is Oscar Issacs performance as Victor, who manages to be the compelling mad scientist that the story deserves. Practical effects are also excellent, although the decision to include strange-looking CGI deer and wolves in the middle portion cheapened the work of the effects team.\n\nWhere Frankenstien really goes wrong is in its cloying sentimentality. This is most true in the overbearing score, and some parts of the script. Frankenstein is filled with saccarine moments, building throughout the movie, rather than true pathos. The monster, who we see viciously murdering people at the beginning of the movie (the end chronologically), feels like a character who would never do such a thing once we see his path to get to that moment. While the depiction of the monster is more in line with Mary Shelley’s vision than some modern references, Del Toro makes him altruistic to the point of one-dimensionality. A monster that is unquestionably good is no more interesting than a monster that is unquestionably evil. Like any being, the monster should have some rougher edges to his intentions. In Frankenstien 2025, he is an almost completely pure entity, which diminishes the character.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "noah",
    "score": 8,
    "reviewText": "One Battle After Another is a portrait of American extremism that everybody seems to have a hot take about. To it’s credit, this movie eludes hot takes easily. The leftist “revolutionaries” are egotistical, backstabbing, and ineffective, while the fascist they are fighting is a hypocritical child murderer. These two groups operate in opposition to each other, and often the law. As such, this movie draws inspiration from classic Western films. The excellent car chase scene at the end of the movie is a great climax to the plot. With great direction, cinematography, and acting, this is a very good movie, although not a must-see. Leonardo de Caprio’s character falling off a tree will always be pretty funny.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "noah",
    "score": 7,
    "reviewText": "Kpop demon hunters is a childrens movie which is enjoyable for adults. While the story structure is basic (it could be used for a great film 101 examplar) it is executed very well. The movie makes due with a much lower budget than Disney or Pixar, and while this is visible in somewhat static backgrounds and less realisitic physics, the film uses this limitation in many instances as a strength. A good example is that character assets often move in complete synchronization to each other, a slightly uncanny effect which only slightly exaggerates the synchronization of actual Kpop bands. The standout here is the music, with several songs (e.g., Soda Pop, Golden, Your Idol) which are earwormy singles outside of the confines of the movie plot.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "noah",
    "score": "5",
    "reviewText": "The success of horror often hinges on the central metaphor. Movies that are scary because they bring up fears that we experience in real-life have more staying power than movies which rely on jump scares and scary imagery. While Weapons attempts to have a central metaphor, it is both too on the nose (an AR 15 hovering over a house), and too unconnected to the plot (which is about witches kidnapping children) to be thematically comprehensible. Also, the police in the movie are complete idiots. The first thing the detectives should do is look at what direction the children ran in, to see if they went to the same place. But it took a community member to come up with this incredibly simple way of solving the mystery.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "zach",
    "score": "5.5",
    "reviewText": "I liked the bit when the kids tore the woman to shreds. However, as well-made as it was, I think they spoiled \"the twist\" a bit too early on, and so the rest of the movie felt a bit underwhelming. Still, it was a good analogy for...the thing it analogizes.",
    "reviewDate": "2026-01-24"
  },
  {
    "movieId": "2026-movie-g",
    "panelistId": "sam",
    "score": "8.5",
    "reviewText": "I really loved Sinners. It’s intense, confident, and way more emotionally grounded than I expected. What stuck with me most is how clearly the film understands that “sin” isn’t neutral—race shapes who gets sympathy, who gets forgiveness, and who’s condemned from the jump.\nThe movie does a great job showing how Black characters are constantly watched, judged, and read as guilty, even in moments of vulnerability. There’s this ongoing tension between being seen and being surveilled, between confession as honesty and confession as something dangerous. None of it feels preachy—the racial themes are baked into the story, the performances, and even how the camera moves.",
    "reviewDate": "2026-01-25"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "sam",
    "score": "9",
    "reviewText": "Weapons is one of those movies that creeps up on you and doesn’t let go. It starts off feeling familiar, almost deceptively so, and then slowly turns the screws until everything feels off in the best way. The tension builds patiently, without relying on cheap shocks, and when it does hit, it lands hard.\nWhat really worked for me was how unsettling the atmosphere is. There’s this constant sense that something is wrong, even in the quieter moments, and the movie trusts the audience enough to sit with that discomfort. The performances feel grounded, which makes the horror elements hit even harder—you believe these people, so you care when things spiral.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-a",
    "panelistId": "sam",
    "score": "7.5",
    "reviewText": "Avatar 3 is really cool to look at—like, insanely cool. The visuals and world-building are still doing most of the heavy lifting, and some of the new stuff on Pandora is genuinely awesome.\nBut story-wise, it didn’t totally pull me in. A lot is happening, and not all of it hits emotionally. I wasn’t bored, just not fully locked in.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "sam",
    "score": "6",
    "reviewText": "K-Pop Demon Hunters is colorful, fast, and clearly made with kids in mind. The music is catchy, the animation pops, and it moves at a fun clip without getting too scary. I can totally see younger audiences loving it.\nThat said, it wasn’t really my thing. The story and humor felt pretty lightweight, and I never fully clicked with it. Still, it’s fun for what it is—just not a movie that was meant for me.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "jacob",
    "score": "8",
    "reviewText": "Set in a small town, Weapons felt full of personality and character. And that, the people, was the films real focus. Its supernatural main story line was well done but came short of the believability which makes a horror film what it is—scary. Instead the ‘scary story’ served mostly to frame the lives of the everyday folks impacted by the traumatic goings-on in their community. We see these events through the lens of a young female teacher, a cop, a father, an orphan, an old lady, and a drug addict. Their lives and their relationships with one other is what most of the movie is concerned with, building a suspense for the eventual standoff with the big bad, which suspense —unlike most films of the genre—feels anything but gratuitous.",
    "reviewDate": "2026-01-26"
  },
  {
    "movieId": "2026-movie-g",
    "panelistId": "stephan",
    "score": "10",
    "reviewText": "The amount of genre blending that this film does should be illegal. Michael B. Jordan gives an incredible performance as a believable set of twins. That oner will forever be one of my favorite film sequences of all time",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "stephan",
    "score": "9.5",
    "reviewText": "I didn’t initially believe the hype this movie had. It seemed too good to be true, but I was wrong and my expectations were understated. I genuinely believe this film is the Best Picture winner for the 2025 year, and it deserves all of its praise ",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-h",
    "panelistId": "stephan",
    "score": "8",
    "reviewText": "Can’t say much about this one other than the fact that Jesse Plemmons deserves an Oscar nod for this role, and Emma Stone kills it as always. Go watch",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-i",
    "panelistId": "stephan",
    "score": "7",
    "reviewText": "Vroom vroom car go fast",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-c",
    "panelistId": "stephan",
    "score": "6",
    "reviewText": "I was disappointed by this one. Guiellermo del Toro has made some beautiful films, and this one is no exception, but where it thrives in visuals, it falls apart in Jacob Elordi’s lackluster performance and utterly snail-like pacing",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-j",
    "panelistId": "stephan",
    "score": "8",
    "reviewText": "This one made me cry. There’s something beautiful about experiencing a man just live his life, experiencing love, loss, renewal, and death, all in a 2 hour runtime",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-b",
    "panelistId": "stephan",
    "score": "8.5",
    "reviewText": "I genuinely need to know the marketing budget for this film. It had to have been off the walls..\nAnyway, Timothee kills it in this role and gives it his all without it feeling like his desperate attempt at achieving an Oscar win. The pacing is relentless, evoking the feelings of “Good Time,” and “Uncut Gems,” yet unlike those films, it feels breathable at times, which was refreshing",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-k",
    "panelistId": "zach",
    "score": "4",
    "reviewText": "I guess it was cool to see police procedures of a true crime (especially about one as emotional as this crime) through body cam footage, but even as far as the true crime genre goes - it wasn't all that exciting. And as far as body cam footage goes, COPS is much more entertaining. I genuinely feel like the overwhelmingly positive reviews are a result of people going \"Wow! So innovative!\", and it honestly feels a little performative. Wouldn't recommend tbh. Just read about the case if you want lol.",
    "reviewDate": "2026-01-27"
  },
  {
    "movieId": "2026-movie-e",
    "panelistId": "beau",
    "score": "6.5",
    "reviewText": "I entered the theatre with high expectations and left slightly disappointed, though with a bizarre appreciation for Sean Penn. On the whole, <i>One Battle After Another</i> feels like an overbuilt attempt at a <i>Pulp Fiction</i> –esque, stylized, period-set, action-dramedy, but it lacks any real originality. It isn’t as narratively polished as PTA’s classics, nor are the characters as compelling. Impersonal performances from DiCaprio, Taylor, and Infiniti somehow manage to feel both bland and overacted, while Sean Penn erupts with a performance whose raw, intoxicating conviction seems imported from a far more interesting film. Moments feel like scenes, places look like sets, and relentless, unabashed attempts at social commentary quickly begin to grate. The narrative, while technically coherent, is only enjoyable if one accepts the intrusion of the least plausible choice at every turn. A few genuinely edgy comedic beats and Penn’s spiritually indomitable Colonel Lockjaw offer a much needed respite.",
    "reviewDate": "2026-01-28"
  },
  {
    "movieId": "2026-movie-i",
    "panelistId": "beau",
    "score": "6",
    "reviewText": "Race cars are very cool, as is Brad Pitt. <i>F1</i> is predicated on those two facts, and little thought is put to anything else. There is minimal emotional depth to this film, but it is nevertheless enjoyable by virtue of its dual-threat approach.",
    "reviewDate": "2026-01-28"
  },
  {
    "movieId": "2026-movie-d",
    "panelistId": "beau",
    "score": "7.5",
    "reviewText": "Some movies just seem to squeeze more than their fair share of fun out of a runtime. A dense, energetic masterclass in breathing new life into time-tested themes, <i>K-Pop Demon Hunters</i> earned its brief, fiery run as a cultural phenomenon through timely cultural positioning, an excellent original score, and magnetic animation. The good-versus-evil plot is dead simple, yet inventively framed and thematically boosted by a healthy splash of yin and yang. Contrasting lighthearted K-pop performances with PG-rated demon-slaying action is borderline inspired beneath the spellbinding bump of instant classics like Huntrix’s “Golden” and Saja Boy’s “Soda Pop.” By leaning completely into the creative freedoms provided by animation and sticking firmly to the tenets of good storytelling, <i>K-Pop Demon Hunters</i> turns what could have been a middling children’s screenplay into an engaging, if low-impact, musical whirlwind. ",
    "reviewDate": "2026-01-28"
  },
  {
    "movieId": "2026-movie-a",
    "panelistId": "stephan",
    "score": "6.5",
    "reviewText": "The third of the Avatar series was one I was genuinely excited for, after I was pleasantly surprised by the long awaited sequel, “The Way of Water” in 2022. James Cameron has crafted a now iconic world inside and out, and is still showing the audience that there’s more to it with each entry. However, I found that the plot of this film follows very similar beats to the previous two entries, leaving me wanting a lot more and restless during its 3+ hour runtime. Thankfully, the performances by Sam Worthington, Zoe Saldana, and Stephen Lang always impress and really carry this film. I’ll always be happy to see them on screen in these films should Cameron choose to continue the series.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "stephan",
    "score": "7",
    "reviewText": "Unfortunately, I was late to the viewing hype of this film, so I went in with somewhat high expectations, as are most of my experiences with horror these days after the Ari Aster renaissance of the late 2010s.\nWeapons surprised me with its shifting narrative perspectives between each main character, however I believe this dragged the pacing a bit and left me feeling antsy about where each storyline was heading. I think the framing was supposed to mimic that of a “Whodunit” film, but I found myself less intrigued in the mystery by the time the bulk of the plot had progressed. That said, Weapons is a solid entry in the horror genre, and I’d happily rewatch it to pick up elements that I missed.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-1",
    "panelistId": "sam",
    "score": "10",
    "reviewText": "This movie is such a comfort watch. Everyone in the family is kind of a mess, but that’s what makes it work. It’s genuinely funny, but also really sweet in a low-key way. The pageant scene is perfect chaos and somehow turns into this big moment about loving each other exactly as you are.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-2",
    "panelistId": "sam",
    "score": "10",
    "reviewText": "This one is creepy in a slow, unsettling way. It’s about our obsession with watching, filming, and turning everything into a moment—even when it’s dangerous. The alien is scary because it doesn’t care about humans at all. It’s less about jump scares and more about this constant feeling that something is wrong.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-3",
    "panelistId": "sam",
    "score": "10",
    "reviewText": "One of those movies where you have no idea where it’s going, and that’s what makes it so good. It’s funny, tense, uncomfortable, and then suddenly devastating. The way it shows class differences feels real and sharp without spelling anything out. Every little detail pays off, and the ending hits hard because it feels unavoidable.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-4",
    "panelistId": "sam",
    "score": "10",
    "reviewText": "This movie is heavy but so worth it. Watching Michael become colder and more alone while gaining more power is brutal. The scenes of young Vito make the contrast even sadder, showing how far everything has fallen. By the end, Michael has won—but it feels like the worst kind of win",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-5",
    "panelistId": "sam",
    "score": "10",
    "reviewText": "This movie gets under your skin in a really quiet way. It’s not a love story at all—it’s about obsession and how creepy it is to try to turn someone into an idea instead of a person. The visuals feel hazy and dreamlike, like you’re stuck in someone else’s head, and the ending just leaves you feeling unsettled. It lingers long after it’s over.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-6",
    "panelistId": "zach",
    "score": "9.5",
    "reviewText": "While this is a (second) remake of the original film (based on a novel), it was a bit prescient how this came out the same year Russia invaded Ukraine. The movie focuses on the characters most people should consider to be the bad guys, and how they fall prey to nationalist propaganda urging them to invade a foreign country. It does a very good job at showing the brutality of war - in fact, I wish it had gone even further at this task. So much went wrong in the 20th century, and it's kind of depressing to see just one front in the first of two world wars play out at such an extreme scale; the number of very young men returning home in bodybags to WW1 Germany was insane - and again - these are the bad guys you're not supposed to be cheering for. One fun fact about this movie is that it shows some of the soldiers deserting Germany and getting shot for doing so, presumably to make you empathize with these characters. But in reality, this hardly ever happened, which I guess only further illustrates the propaganda young men faced in this period.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-7",
    "panelistId": "zach",
    "score": "9.5",
    "reviewText": "This is an interactive film which presents scenes based on decisions you select for the main character to make. This film is very interesting because there's a total of over 5 hours of runtime, but you're only going to experience around 90 minutes in a single viewing. I really enjoyed <i>Bandersnatch</i> because it really helps you understand the concept of free will and it truly may not exist (I believe it probably does not). And it's more or less fairly realistic how just a few differences in initial choices can indeed influence long-term outcomes. In my opinion, children should be shown this film in schools to understand the importance of choices, and maybe to give them some initial existential terror at the thought of the lack of free will.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-8",
    "panelistId": "zach",
    "score": "9.5",
    "reviewText": "There's little else to say about <i>Borat</i> other than that Sacha Baron Cohen is a genius manipulator and master planner. He deserves a very unique Academy Award that does not exist. It also kind of gives me nostalgia for the early-2000s era when comedy was a bit more...unrestrained.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-9",
    "panelistId": "zach",
    "score": "9.5",
    "reviewText": "Timeless classic. I love Early Medieval England too, so it's basically like a funny history lesson.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-f",
    "panelistId": "beau",
    "score": "7.5",
    "reviewText": "Kids doing violence is a classic basis for a horror flick, and Weapons leverages it well. A thoughtfully crafted plot reveals itself through a series of overlapping vignettes that explore the experiences and intertwined lives of townsfolk as they struggle through sinister circumstances that rock Maybrook, PA. Well cast, well written, and well acted, the unique lives of each player feel organically connected, while the individuals themselves feel organically flawed. Their frustrating, bullish behavior is softened by moments of earned vulnerability—it’s hard to know exactly who you’re rooting for well past the midpoint of the film—and well designed expectations are gently subverted. A careful balance is struck between the slow-building tension that permeates the film and sparse, thus effective, jump scares. The score is serviceable, and the film’s commentary is embedded so naturally within credible character flaws that its lack of originality never feels off-putting. The climax, though satisfying, feels slightly forced, perhaps due to the antagonist’s sudden, uncharacteristic impotence. Questions left unanswered allow a pleasing curiosity to linger past the credits, a testament to the narrative’s quality and the investment it fosters in the characters’ lives.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "favorites-27",
    "panelistId": "noah",
    "score": "9.5",
    "reviewText": "Burning is a movie that starts innocuously enough, when two schoolmates from the Korean countryside (Jong-Su and Hae-Mi) happen to meet up in Seoul. However, this psychological thriller slowly and steadily creeps under your skin. Things, animals, and people appear and disappear from people’s lives. Every question answered—while seemingly important and relevant—only digs Jong-su (and us as viewers), deeper into a well of uncertainty and unreality. Burning—like many modernist masterpieces—lacks any objective perspectives or reliable narrator. Every character, conversation, and scene is a Schrodinger’s cat, different in substance depending on the angle from which it is looked at. Lust, love, class, and violence all lurk in the background, as they do in life. The climax—final and satisfying in some ways—also serves to close off the possibility of truth forever.\n \nWith three standout performances, Burning has some of the best acting, direction, and cinematography ever put to screen. While it has a lot of parallels to the equally good Blow Up (1966), it carves out a space of its own as an incredible work of art.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-l",
    "panelistId": "zach",
    "score": "8.5",
    "reviewText": "I loved this movie for very unique, personal reasons. Early 2020 was a pivotal moment in my life. For one, Covid was wreaking havoc on the world and changing society and norms in ways we'd never seen before. For the first few months, no one knew what was going to happen or how governments would manage the crisis. It was a very weird time for everyone. Then, a couple months into the pandemic, George Floyd was killed and BLM protests and riots ensued and capitivated the nation. People were posting black squares and reposting instagram activist media daily, and it was a very, very, emotionally charged and bizarre time. In the same period, it felt like political grifts were reaching unprecedented levels - politicans and influencers alike were exploiting the pandemic and pandemic-related lockdown measures to influence the population about various narratives. Seeing all of this referenced non-stop in the film, which itself was a well-made slow burn modern western, was very cool. I strongly recommend it.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-m",
    "panelistId": "zach",
    "score": "5.5",
    "reviewText": "I mean, it's okay. Not was good as the first one, but I guess it's a fun time. It's the kind of thing I'd only watch if I've had a few drinks (which I did before watching it).",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-n",
    "panelistId": "zach",
    "score": "6",
    "reviewText": "It felt kind of silly at times (Mark Hamill's character saying 'We're in an epidemic of laziness!' made me laugh, as if that justifies making 50 young men go on death marches every year. Still, it was a fun time. Also a good movie to watch with friends + drinks.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "2026-movie-o",
    "panelistId": "zach",
    "score": "6",
    "reviewText": "It was okay. I didn't even know it was a sequel of another movie until I read the movie's wikipedia page. Definitely not a contender for best international feature or anything, but it was a fun watch.",
    "reviewDate": "2026-01-29"
  },
  {
    "movieId": "",
    "panelistId": "",
    "score": "",
    "reviewText": "",
    "reviewDate": ""
  }
]
